In [ ]:
#LG Notes for reference
#4.1.05 -> unique/array
#4.1.07 -> column rename
#4.1.11 -> unique for adding up
    #author_count = len(goodreads_df["Authors"].unique())

#4.2.01 -> loc
    # Grab the data contained within the "Berry" row and the "Phone Number" column
    #berry_phone = df.loc["Berry", "Phone Number"]
    #print("Using Loc: " + berry_phone)
#4.2.03 -> cleaning data
    #

In [ ]:
#DataFrame.loc -> use possibly for age group

In [ ]:
#clean data by age group desired, city, and year
#age group = 25-39
#cities:
#year = 20

In [6]:
#dependencies

import pandas as pd

In [8]:
#Use Pandas to read data
age_data_df = pd.read_csv("Age_Data.csv")

In [9]:
#print to view
age_data.head()

   Unnamed: 0  Year        City        Age Range  Number in Range
0           0  2018  Albany, NY   18 to 24 Years            21091
1           1  2018  Albany, NY  75 Years & Over             5906
2           2  2018  Albany, NY   45 to 54 Years            10514
3           3  2018  Albany, NY    Under 5 Years             5491
4           4  2018  Albany, NY   65 to 74 Years             6670

In [10]:
#look for missing values
#awesome to see!
age_data_df.count()

Unnamed: 0         16236
Year               16236
City               16236
Age Range          16236
Number in Range    16236
dtype: int64

In [14]:
#sort by year
age_data_df.sort_values(by=["Year"])

,Unnamed: 0,Year,City,Age Range,Number in Range
8117,8117,2013,"Los Angeles, CA",Under 5 Years,249942
6991,6991,2013,"Indianapolis city (balance), IN",60 & 61 Years,18161
6990,6990,2013,"Indianapolis city (balance), IN",25 to 34 Years,139215
6989,6989,2013,"Indianapolis city (balance), IN",35 to 44 Years,108946
6988,6988,2013,"Indianapolis city (balance), IN",62 to 64 Years,23520
...,...,...,...,...,...
6602,6602,2018,"Houston, TX",45 to 54 Years,273635
6601,6601,2018,"Houston, TX",75 Years & Over,100271
6600,6600,2018,"Houston, TX",18 to 24 Years,230538
6609,6609,2018,"Houston, TX",25 to 34 Years,428263
0,0,2018,"Albany, NY",18 to 24 Years,21091

In [ ]:
#lets get data by year - 2015 with age group 25-34; all cities

age_data_df.loc[age_data_df["Year"] == 2015
]